[
  {
    "name": "Lombos de borrego",
    "image": "https://www.pingodoce.pt/wp-content/uploads/2015/12/1449085347",
    "link": "https://www.pingodoce.pt/receitas/lombos-de-borrego/",
    "portions": 6,
    "ingredients": [
      {
        "name": "feijão preto",
        "qtd": 150,
        "unit": "g"
      },
      {
        "name": "louro",
        "qtd": 1,
        "unit": "folha"
      },
      {
        "name": "alho",
        "qtd": 4,
        "unit": "dente"
      },
      {
        "name": "lombo de borrego sem osso",
        "qtd": 700,
        "unit": "g"
      },
      {
        "name": "sal",
        "qtd": 1,
        "unit": "c. de chá"
      },
      {
        "name": "pimenta",
        "qtd": 1,
        "unit": "q.b."
      },
      {
        "name": "vinho tinto",
        "qtd": 0,
        "unit": ",5 dl"
      },
      {
        "name": "brócolos",
        "qtd": 600,
        "unit": "g"
      },
      {
        "name": "azeite",
        "qtd": 4,
        "unit": "c. de sopa"
      }
    ],
    "rawIngredients": [
      {
        "id": 1009,
        "g": 150,
        "ml": 0
      },
      {
        "id": 1384,
        "g": 1,
        "ml": 0
      },
      {
        "id": 89,
        "g": 12,
        "ml": 0
      },
      {
        "id": 1358,
        "g": 700,
        "ml": 0
      },
      {
        "id": 2336,
        "g": 5,
        "ml": 0
      },
      {
        "id": 2028,
        "g": 2,
        "ml": 0
      },
      {
        "id": 2631,
        "g": 0,
        "ml": 0
      },
      {
        "id": 438,
        "g": 600,
        "ml": 0
      },
      {
        "id": 208,
        "g": 0,
        "ml": 60
      }
    ],
    "steps": [
      "Ponha o feijão de molho na véspera. No dia seguinte, coloque-o numa panela com água, com um dente de alho e a folha de louro, e coza-o durante cerca de 1 hora e 40 minutos. Escorra-o e reserve.",
      "Numa frigideira com 2 colheres de azeite e os restantes dentes de alho, previamente pisados, salteie a carne limpa de toda a gordura. Deixe dourar de todos os lados durante alguns minutos (o interior da carne deve ficar rosado), tempere com sal e pimenta e retire da frigideira.",
      "Acrescente então o vinho à frigideira e cozinhe-o juntamente com o suco da carne, deixando evaporar. Uma vez reduzido o molho, junte o feijão. Mexa, rectifique os temperos e deixe apurar por alguns minutos.",
      "Coza os brócolos, de preferência ao vapor. Sirva a carne cortada em fatias finas, acompanhada com o feijão, e os brócolos temperados com o restante azeite."
    ]
  },
  {
    "name": "Bacalhau fresco a vapor",
    "image": "https://www.pingodoce.pt/wp-content/uploads/2016/02/617x370_bacalhau-fresco.jpg",
    "link": "https://www.pingodoce.pt/receitas/bacalhau-fresco-a-vapor/",
    "portions": 4,
    "ingredients": [
      {
        "name": "bacalhau fresco",
        "qtd": 600,
        "unit": "g"
      },
      {
        "name": "courgette pequena",
        "qtd": 1,
        "unit": "unid."
      },
      {
        "name": "batata",
        "qtd": 50,
        "unit": "g"
      },
      {
        "name": "uva preta sem grainha",
        "qtd": 80,
        "unit": "g"
      },
      {
        "name": "vinho branco alentejano",
        "qtd": 1,
        "unit": ",5 dl"
      },
      {
        "name": "cebola",
        "qtd": 0.5,
        "unit": "unid."
      },
      {
        "name": "cebolinho",
        "qtd": 1,
        "unit": "q.b."
      },
      {
        "name": "natas",
        "qtd": 50,
        "unit": "g"
      },
      {
        "name": "sal grosso",
        "qtd": 1,
        "unit": "c. de sopa"
      },
      {
        "name": "louro",
        "qtd": 1,
        "unit": "folha"
      },
      {
        "name": "tomate zebra",
        "qtd": 2,
        "unit": "unid."
      },
      {
        "name": "azeite",
        "qtd": 1,
        "unit": "c. de sopa"
      }
    ],
    "rawIngredients": [
      {
        "id": 267,
        "g": 600,
        "ml": 0
      },
      {
        "id": 772,
        "g": 1,
        "ml": 1
      },
      {
        "id": 302,
        "g": 50,
        "ml": 0
      },
      {
        "id": 2574,
        "g": 80,
        "ml": 0
      },
      {
        "id": 2609,
        "g": 0,
        "ml": 100
      },
      {
        "id": 564,
        "g": 0,
        "ml": 0
      },
      {
        "id": 584,
        "g": 10,
        "ml": 0
      },
      {
        "id": 1756,
        "g": 0,
        "ml": 50
      },
      {
        "id": 2344,
        "g": 13,
        "ml": 0
      },
      {
        "id": 1384,
        "g": 1,
        "ml": 0
      },
      {
        "id": 2528,
        "g": 2,
        "ml": 2
      },
      {
        "id": 208,
        "g": 0,
        "ml": 15
      }
    ],
    "steps": [
      "Peça na peixaria para amanharem o bacalhau e separarem os lombos, mantendo a pele. Reserve as espinhas.",
      "Num tacho, coloque o vinho branco, a cebola e o alho. Deixe ferver até reduzir para metade o líquido.",
      "Coloque outro recipiente com água temperada com um pouco de sal ao lume, adicione as espinhas e deixe ferver. Retire do lume, junte as natas, misturando bem, e adicione este preparado à redução de vinho branco. Leve ao lume para reduzir mais um pouco. Retire do lume e adicione o cebolinho picado (reservando algum para a decoração) e reserve.",
      "Leve ao lume uma panela com rede incorporada, junte-lhe água e coza o bacalhau ao vapor, salpicado com um pouco de sal, e reserve. Coza as batatas juntamente com a cenoura e reduza-as a puré com uma consistência forte e tempere com um pouco de sal.",
      "Lave e corte a courgette em rodelas uniformes, salpique com umas pedras de sal, salteie com uma colher de azeite bem quente e reserve.",
      "Coloque um aro de metal no centro do prato de servir e forre o fundo com algumas rodelas de courgette salteadas. Por cima, disponha o puré de batata e cenoura, pressionando para que fique tudo bem calcado, e desenforme. Por cima, coloque as restantes rodelas de courgette. Ao lado, coloque o bacalhau e regue com o creme preparado. Decore com as uvas, a que retirou previamente a pele, o tomate zebra em quartos e o cebolinho picado."
    ]
  },
  {
    "name": "Ravioli com rúcula e cogumelos",
    "image": "https://www.pingodoce.pt/wp-content/uploads/2017/10/raviollis-com-rucula-e-cogumelos.jpg",
    "link": "https://www.pingodoce.pt/receitas/ravioli-com-rucula-e-cogumelos/",
    "portions": 4,
    "ingredients": [
      {
        "name": "miolo de noz",
        "qtd": 50,
        "unit": "g"
      },
      {
        "name": "folhas de rúcula",
        "qtd": 100,
        "unit": "g"
      },
      {
        "name": "sal",
        "qtd": 1,
        "unit": "c. de chá"
      },
      {
        "name": "farinha",
        "qtd": 200,
        "unit": "g"
      },
      {
        "name": "ovo M",
        "qtd": 2,
        "unit": "unid."
      },
      {
        "name": "azeite",
        "qtd": 2,
        "unit": "c. de sopa"
      },
      {
        "name": "azeite",
        "qtd": 1,
        "unit": "c. de sobremesa"
      },
      {
        "name": "chalota",
        "qtd": 1,
        "unit": "unid."
      },
      {
        "name": "cogumelo Portobello pequeno",
        "qtd": 300,
        "unit": "g"
      },
      {
        "name": "requeijão",
        "qtd": 1,
        "unit": "unid."
      },
      {
        "name": "mistura de pimenta em moinho",
        "qtd": 1,
        "unit": "q.b."
      },
      {
        "name": "tomate seco",
        "qtd": 20,
        "unit": "g"
      },
      {
        "name": "tomate mini alongado",
        "qtd": 100,
        "unit": "g"
      },
      {
        "name": "queijo parmesão",
        "qtd": 20,
        "unit": "g"
      }
    ],
    "rawIngredients": [
      {
        "id": 1622,
        "g": 50,
        "ml": 0
      },
      {
        "id": 2327,
        "g": 100,
        "ml": 0
      },
      {
        "id": 2336,
        "g": 5,
        "ml": 0
      },
      {
        "id": 931,
        "g": 200,
        "ml": 0
      },
      {
        "id": 1824,
        "g": 2,
        "ml": 2
      },
      {
        "id": 208,
        "g": 0,
        "ml": 30
      },
      {
        "id": 208,
        "g": 0,
        "ml": 10
      },
      {
        "id": 612,
        "g": 1,
        "ml": 1
      },
      {
        "id": 728,
        "g": 300,
        "ml": 0
      },
      {
        "id": 2315,
        "g": 1,
        "ml": 1
      },
      {
        "id": 1664,
        "g": 5,
        "ml": 0
      },
      {
        "id": 2524,
        "g": 20,
        "ml": 0
      },
      {
        "id": 2514,
        "g": 100,
        "ml": 0
      },
      {
        "id": 2271,
        "g": 20,
        "ml": 0
      }
    ],
    "steps": [
      "Triture o miolo de noz num robot de cozinha, ou picadora, e reserve.",
      "Reserve 1/3 da rúcula e escalde a restante cerca de 30 segundos num tacho com água a ferver, temperada com uma colher de chá de sal. Retire com um coador, passe por água fria corrente e escorra bem. Reserve o tacho com a água.",
      "Esprema bem a rúcula escaldada, coloque-a no robot de cozinha, ou picadora, e triture. Retire metade para um recipiente, junte a farinha, os ovos e uma colher de sobremesa de azeite e volte a ligar o robot até os ingredientes começarem a unir-se. Retire para uma bancada de trabalho enfarinhada e amasse até a massa se descolar dos dedos. Embrulhe em película aderente e deixe repousar 30 minutos.",
      "Pique finamente as chalotas e leve-as ao lume numa frigideira com uma colher de sopa de azeite. Lave os cogumelos em água corrente, pique-os em pedaços pequenos e junte-os às chalotas assim que começarem a alourar. Salteie 5 minutos, em lume médio a forte, mexendo frequentemente. Retire do lume e deixe arrefecer um pouco.",
      "Numa tigela, esmague o requeijão com a rúcula triturada, junte cerca de 1/3 dos cogumelos refogados, bem escorridos, e metade das nozes picadas. Misture bem com um garfo e tempere com uma pitada de pimenta.",
      "Numa bancada enfarinhada, divida a massa ao meio e, com a máquina ou com o rolo, estenda cada porção até obter uma placa fina.",
      "Com uma colher de sobremesa, disponha o recheio em montes, afastados entre si, sobre uma das placas. Pincele com um pouco de água e cubra com a outra placa de massa. Corte círculos com cerca de 7 cm de diâmetro e pressione os bordos dos ravioli com os dentes de um garfo para fazer aderir bem a massa. Volte a estender as sobras da massa e repita o processo.",
      "Aqueça de novo a água onde escaldou a rúcula e, assim que ferver, coza os ravioli cerca de 6 minutos.",
      "Distribua a rúcula reservada e os cogumelos pelos pratos de servir e, por cima, disponha os ravioli bem escorridos. Regue com o restante azeite e decore com o tomate seco cortado em tiras finas e metades de tomate mini. Salpique com as nozes reservadas e as lascas de queijo parmesão."
    ]
  }
]